docs/code_graph.dot
digraph code_graph {
  rankdir=LR;
  node [shape=box, style=rounded, fontname="Consolas"];
  "api";
  "core";
  "exchange";
  "ipc";
  "main";
  "regime";
  "risk";
  "strategy";
  "universe";
  "utils";
  "api" -> "core" [label="14"];
  "api" -> "utils" [label="8"];
  "core" -> "api" [label="11"];
  "core" -> "ipc" [label="15"];
  "core" -> "risk" [label="10"];
  "core" -> "strategy" [label="4"];
  "core" -> "universe" [label="2"];
  "core" -> "utils" [label="48"];
  "exchange" -> "core" [label="7"];
  "exchange" -> "utils" [label="3"];
  "ipc" -> "api" [label="3"];
  "ipc" -> "core" [label="27"];
  "ipc" -> "risk" [label="1"];
  "ipc" -> "utils" [label="15"];
  "main" -> "core" [label="4"];
  "main" -> "strategy" [label="1"];
  "main" -> "utils" [label="2"];
  "regime" -> "api" [label="1"];
  "regime" -> "core" [label="1"];
  "regime" -> "utils" [label="3"];
  "risk" -> "core" [label="12"];
  "risk" -> "ipc" [label="2"];
  "risk" -> "utils" [label="5"];
  "strategy" -> "api" [label="6"];
  "strategy" -> "core" [label="29"];
  "strategy" -> "risk" [label="1"];
  "strategy" -> "universe" [label="7"];
  "strategy" -> "utils" [label="15"];
  "universe" -> "api" [label="2"];
  "universe" -> "core" [label="16"];
  "universe" -> "utils" [label="26"];
  "utils" -> "core" [label="1"];
}
